app/views/messages/create.json.jbuilder

  json.content  message.content
  json.time  message.created_at.strftime("%Y年%m月%d日 %H時%M分")
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('asda', 8, 1, '2019-09-22 18:13:53', '2019-09-22 18:13:53')