app/views/groups/_form.html.haml

      #chat-group-users
        - @group.users.each do |user|
---
SELECT `users`.* FROM `users`