app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 5 ORDER BY `messages`.`id` DESC LIMIT 1
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'cat1.png', 5, 1, '2019-09-13 21:04:34', '2019-09-13 21:04:34')
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save