app/controllers/users_controller.rb

UPDATE `users` SET `name` = 'asfcv', `email` = 'adg.makoto@gmail.comsssaaaaaaaav', `updated_at` = '2019-09-04 11:19:26' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)